// task 1 Задание 2
var information="В Украине рождество отмечают 25/12 и 07/01.";
// Отображение содержимого переменной сточног типа информация во всплывающем окне
alert(information);
// task4 Задание 4
var nr1,nr2;
nr1=7;
nr2=nr1*2+15;
alert("результат выражения: "+nr2); //Математическое выражение и его результат
//task 6  Задание 6
alert("Длинна строки с именем информация соотвецтвует: "+information.length);//Подсчет символов в строке
//task7 Задание 7
var infNew=information.replace("25/12","25 Декабря");
infNew=infNew.replace("07/01","7 Января");//Замена символов в стоке
alert(infNew);